# 접근자Accessor 실습

- DF/SR에 속성으로 제공되며, 다른 객체의 기능/속성을 사용할 수 있도록 해줌.

- 종류
    - Series.dt  : datetime 속성 사용할 수 있도록 해줌.
    - Series.str : string 관련 메서드 사용할 수 있도록 해줌.
    - DataFrame.spare : spare 관련 속성/메서드 사용할 수 있도록 해줌.

In [104]:
# 모듈 로딩
import pandas as pd, random

# 데이터 생성 ------------
# 이름, 생년월일, 나이 3개 컬럼으로 구성
# 10명
# 생년월일 : 동년해, 동일날짜  <-  date_range()
# 이름 : 영문 (예 : Tom KIm)
df=pd.DataFrame({ 'name' : ['Glidong Hong','Sam Kim', 'Leo Choi', 'John Park',
                     'John Jo', 'Steven Kim', 'Hae Song', 'Hary Sin',
                     'Red Park', 'Minsu Lee'],
             'age' : [random.randint(17,25) for count in range(10)],
             'birth' : pd.date_range('2020-1-10', periods=10, freq='M') })
df

           name  age      birth
0  Glidong Hong   23 2020-01-31
1       Sam Kim   18 2020-02-29
2      Leo Choi   17 2020-03-31
3     John Park   20 2020-04-30
4       John Jo   21 2020-05-31
5    Steven Kim   25 2020-06-30
6      Hae Song   24 2020-07-31
7      Hary Sin   21 2020-08-31
8      Red Park   19 2020-09-30
9     Minsu Lee   25 2020-10-31

In [105]:
df.dtypes

name             object
age               int64
birth    datetime64[ns]
dtype: object

In [106]:
# 성과 이름을 분리
df['name'][0], type(df['name'][0])

('Glidong Hong', str)

In [107]:
df['name'][0].split()
# df['name'][:].split(), df['name'].split() -> Series 속성은 split 없다고 오류

['Glidong', 'Hong']

In [108]:
filename=df['name'].str.split()

In [109]:
# str 메서드 사용 가능
# df.name.str.upper()
df.name.str.contains('S') # 'S'가 포함되면 True

0    False
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8    False
9    False
Name: name, dtype: bool

In [110]:
type(filename)

pandas.core.series.Series

In [111]:
filename[0][0],filename[0][1]
# 일일이 이렇게 할 수 없음.

('Glidong', 'Hong')

## str 데이터로 구성된 컬럼Series의 str 접근자
- 전체 컬럼의 요소에 str관련 메서드 사용 가능하도록 하는 접근자
- 사용법
    - 객체변수[컬럼명].str.메서드()  => upper,split, replace... 등등
    - 객체변수[컬럼명].str.get(인덱스) => 분리 문자리스트에서 특정 요소 추출

In [112]:
# 강사님
# 분리된 문자열 리스트에서 특정 값 가져오기
filename.str.get(0), filename.str.get(1)

(0    Glidong
 1        Sam
 2        Leo
 3       John
 4       John
 5     Steven
 6        Hae
 7       Hary
 8        Red
 9      Minsu
 Name: name, dtype: object,
 0    Hong
 1     Kim
 2    Choi
 3    Park
 4      Jo
 5     Kim
 6    Song
 7     Sin
 8    Park
 9     Lee
 Name: name, dtype: object)

In [113]:
df['first_name']=filename.str.get(0)
df['last_name']=filename.str.get(1)
df

           name  age      birth first_name last_name
0  Glidong Hong   23 2020-01-31    Glidong      Hong
1       Sam Kim   18 2020-02-29        Sam       Kim
2      Leo Choi   17 2020-03-31        Leo      Choi
3     John Park   20 2020-04-30       John      Park
4       John Jo   21 2020-05-31       John        Jo
5    Steven Kim   25 2020-06-30     Steven       Kim
6      Hae Song   24 2020-07-31        Hae      Song
7      Hary Sin   21 2020-08-31       Hary       Sin
8      Red Park   19 2020-09-30        Red      Park
9     Minsu Lee   25 2020-10-31      Minsu       Lee

In [114]:
## 더 간단하게
# str.split()
# expamd = True하면 스플릿한 것들을 컬럼을 만듬.
value=df['name'].str.split(expand=True)
value

         0     1
0  Glidong  Hong
1      Sam   Kim
2      Leo  Choi
3     John  Park
4     John    Jo
5   Steven   Kim
6      Hae  Song
7     Hary   Sin
8      Red  Park
9    Minsu   Lee

In [115]:
type(value), value.shape, value.ndim, value.columns, value.index

(pandas.core.frame.DataFrame,
 (10, 2),
 2,
 RangeIndex(start=0, stop=2, step=1),
 RangeIndex(start=0, stop=10, step=1))

In [119]:
df2=pd.concat([df, value], axis=1)

In [122]:
df2.rename(columns={'0':'FName', '1':'LName'}, inplace=True)

In [123]:
df2

           name  age      birth first_name last_name        0     1
0  Glidong Hong   23 2020-01-31    Glidong      Hong  Glidong  Hong
1       Sam Kim   18 2020-02-29        Sam       Kim      Sam   Kim
2      Leo Choi   17 2020-03-31        Leo      Choi      Leo  Choi
3     John Park   20 2020-04-30       John      Park     John  Park
4       John Jo   21 2020-05-31       John        Jo     John    Jo
5    Steven Kim   25 2020-06-30     Steven       Kim   Steven   Kim
6      Hae Song   24 2020-07-31        Hae      Song      Hae  Song
7      Hary Sin   21 2020-08-31       Hary       Sin     Hary   Sin
8      Red Park   19 2020-09-30        Red      Park      Red  Park
9     Minsu Lee   25 2020-10-31      Minsu       Lee    Minsu   Lee